//
// Quest ID:17678
// [凱梅爾茲共和國] 到普賽依的艦船上去


npc.next().sayX("怎,怎麼回事。瞬間消失了。去哪兒啦?");
npc.ui(1).uiMax().next().sayX("萊文看那裡!");
npc.next().sayX("不知何時已經回到了自己的艦船上去了嘛。豈有此理!到嘴的鴨子飛了!!");
npc.ui(1).uiMax().next().sayX("怎麼辦呢?就這麼放棄太可惜了,但是對方可是被稱為海盜王的男人啊。隨便進入敵人的根據地會...");
npc.next().sayX("我也知道。可是到目前為止見過無數的普賽依遠征隊。但一次也沒有成功過。現在這是我們走運。如果現在放棄的話說不定就再也沒可能了。");
if (npc.askYesNo("這也許是普賽依佈下的陷阱。你不和我一起去也沒關係。但是我要去。為了我,為了我們的商團,為了凱梅爾茲!")) {
    npc.ui(1).uiMax().next().sayX("嗯...那麼好吧。我也和你一塊去。");
    npc.next().sayX("真的嗎?也許可能就像你說的那樣是陷阱呢。");
    npc.ui(1).uiMax().next().sayX("啊哎,沒關係。我自己會想辦法逃出來的。");
    npc.id(9390204).ui(1).npcFlip().next().sayX("我也一起去吧?");
    npc.next().sayX("你就別去了。你留下來守好這條船。");
    npc.next().sayX("好了,#h0#走吧!我來開條活路!");
    npc.ui(1).uiMax().next().sayX("等會,你在這兒等著。那地方我要一個人去。");
    npc.next().sayX("你說什麼呢。你一個人去置身死地,讓我裝作視而不見嗎?");
    npc.ui(1).uiMax().next().sayX("我說萊文。你現在是這船的艦長。艦長如果離開了這船萬一發生什麼事的話可怎麼辦。我們必須得顧慮到萬一若是發生不測的情況啊。");
    npc.next().sayX("雖說是那樣..可是也..");
    npc.ui(1).uiMax().next().sayX("作為艦長你必須守住船。");
    npc.next().sayX("...拜託你了。");
    map.portalEffect("PuPotal");
    npc.startQuest();
} else {
    npc.ui(1).sayX("對的。你還是留在這裡比較好。");
}