//
// Quest ID:17637
// [凱梅爾茲共和國] 這次的事也由我來解決吧


npc.next().sayX("首領,交給我的話,我就去擊退普賽依。");
npc.id(9390203).ui(1).npcFlip().next().sayX("嗯?你嗎?你和阿庫旁多戰鬥回來都還沒過多久呢");
npc.ui(1).uiMax().next().sayX("(是的。說得對。)");
npc.next().sayX("但是海上貿易不是我們最核心的最重要的部分嘛");
npc.id(9390203).ui(1).npcFlip().next().sayX("正因如此才更那個。當然你出色地阻擋了阿庫旁多,但是普賽依跟阿庫旁多小混混們可不一樣。");
npc.ui(1).uiMax().next().sayX("(對的。萊文還需要再修煉修煉...)");
npc.next().sayX("可,可是..就是那樣!我和#h0#一起去。#h0#的能力相當優秀一定能起到很大幫助的。");
npc.ui(1).uiMax().next().sayX("(嗯？可是，這傢伙幹嘛連我也...！！)");
npc.id(9390203).ui(1).npcFlip().next().sayX("又想借他人之手嗎!!像你這樣的傢伙終究是沒有發展可能的!!每次期待你會有所表現的時候就立刻讓我感到失望!!");
npc.ui(1).uiMax().next().sayX("(呃,怎麼又是這種情況...吉爾伯特首領的話也有他的道理,可是這對我來說也是一個機會。)");
npc.ui(1).uiMax().next().sayX("首領,我和萊文一起去。");
npc.id(9390203).ui(1).npcFlip().next().sayX("上一次也是接受了你的幫助。這次要憑我們自己的力量來完成。");
npc.ui(1).uiMax().next().sayX("上次我也說過了,雖然是友邦國家,但這次我作為萊文的朋友也想拜託你。");
npc.id(9390203).ui(1).npcFlip().next().sayX("嗯..如果這麼說的話讓我考慮考慮。");
npc.startQuest();