//
// Quest ID:17613
// [凱梅爾茲共和國] 統帥的兒子


npc.id(9390201).ui(1).uiMax().npcFlip().next().sayX("你去村子東邊的空房子找找看吧。那裡應該有個面朝大海耍帥的年輕人。他就是#b萊文·達尼爾拉#k。他是個很直爽的青年，應該和你很合得來。");
npc.ui(1).uiMax().meFlip().next().sayX("這麼重要的情報……真是謝謝你，我不會忘記您的恩惠。");
npc.id(9390201).ui(1).uiMax().npcFlip().next().sayX("我不是說過嗎，你是個善良的人啊。而且，我從你的眼神中感受到你的真誠。我不會看錯人的，當然要幫你了。如果你能和凱梅爾茲首領的兒子親近起來，好處可不止一點啊，你快去吧。");
npc.ui(1).uiMax().meFlip().next().sayX("#b(我還奇怪為什麼名叫共和國居然是個小村子……看來是我自己誤會了。)#k");
npc.ui(1).uiMax().meFlip().next().sayX("#b(也是，如果能在冒險島世界的各地進行交易，那肯定是擁有一定規模的船隊，我居然傻到現在都沒發現……#e快點去見見那個首領的二兒子吧。#n)#k");
npc.startQuest();
