/**
 *
 *
 */
npc.next().sayX("最近農場上的#o1210100#有點奇怪。經常無緣無故地發脾氣，做出一些煩人的事情。我對此很擔心，所以今天很早就出來了。果然有一隻#o1210100#鑽過了籬笆，逃到外面去了。");
let ret = npc.askYesNo("在找到#o1210100#之前，必須先把壞了的籬笆修好。還好壞得不是太嚴重，只要有幾個#t4032498#應該就能修好了。小不點，要是你能幫我蒐集#b3個#t4032498##k就好了……");
if (ret == 1) {
    npc.startQuest();
    npc.next().sayX("哦，真是謝謝你。#b#t4032498##k可以從周圍的#r#o0130100##k身上蒐集到。它們雖然不是很強，但不小心的話，可能會遇到危險。你一定要好好使用技能道具。");
    let string = ["UI/tutorial/evan/6/0"];
    npc.sayImage(string);
} else {
    npc.next().sayX("嗯……#p1013101#的話，應該就能幫我了。");
}
