// 
// Quest ID:32242
// 巨大古樹之修嘉


let selection = npc.askMenuX("那個，我叫#b修嘉#k。你不記得我了？\r\n#b#L0# 我記起來了。#l\r\n#b#L1# 我記不得了。#l");
if (selection == 1) {
    npc.next().sayX("原來如此。其實我……在冒險島見到過你。不過既然你想不起來，那你就不用在意我的話。");
} else {
    npc.next().sayX("啊，真的嗎？你記得我？真是太好了。我也記得卩灬孑灬你呢！");
}
npc.next().sayX("其實，我正要去魔法密林參加轉職考試……。不過，下面有那些蟲子在，我沒法過去。由於我非常非常怕蟲子，所以已經手足無措在這裡待了3個多小時了……。");
if (npc.askYesNo("#h0#，你能不能幫幫我呢？要是能幫我趕走下面那些蟲子就好了。")) {
    let bGain = player.hasItem(1322005, 1) || player.gainItem(1322005, 1);
    if (bGain) {
        npc.startQuest();
        map.spawnMob(9300801, 241, -205);
        npc.next().sayX("真的嗎？你要幫我趕走蟲子？謝謝你！\r\n蟲子在通往魔法密林的路口邊。");
        npc.ui(1).sayX("對了，給你，這個是我一直帶著的東西，希望能幫到你……");
    } else {
        npc.ui(1).sayX("對了，我有東西要給你，可是你揹包滿了，清理下。");
    }
} else {
    npc.ui(1).sayX("那樣啊，我拜託你做奇怪的事情真是不好意思。\r\n要想參加轉職考試，無論發生事情都得去魔法密林……。可現在無法去轉職，難道只能在這附近一直練到#b100級#k嗎？嗚嗚……。");
}