/* 2091011, quest:3890, time:2024-06-10 03:08:05 */
npc.next().sayX("你應該知道有根據等級區間分別進行排名吧？");
npc.next().sayX("#e<入門區間>#n\r\n#b105級～200級#k的競爭區間。\r\n\r\n- 全體第1名\r\n  #i1082394:##t1082394#\r\n  #i3700306:##t3700306#\r\n\r\n- 全體第2名\r\n  #i1082660:##t1082660#\r\n\r\n- 全體第3名\r\n  #i1082660:##t1082660#");
npc.next().sayX("#e<達人區間>#n\r\n#b201級以上#k的競爭區間。\r\n\r\n- 全體第1名\r\n  #i1082392:##t1082392#\r\n  #i3700308:##t3700308#\r\n\r\n- 職業第1名\r\n  #i1082393:##t1082393#\r\n  #i3700307:##t3700307#\r\n  #i2631185:##t2631185#\r\n\r\n- 職業第2名\r\n  #i1082394:##t1082394#\r\n\r\n- 職業第3名\r\n  #i1082394:##t1082394#");
npc.next().sayX("獎勵會清算一週間的紀錄後，根據結果配發。");
npc.next().sayX("由於會在每週#r星期天下午11點00分~星期一上午12點30分#k\r\n#b結算排行#k，請務必在那之前\r\n登錄你的記錄。");
npc.next().sayX("獎勵會在排名清算後，\r\n#b來武陵道場找我#k就可以領取。\r\n不要忘記來領了。");
npc.sayX("應該不會有不是前段排名者還耍賴要領取獎勵的吧？");
