/*
 * To change this template, choose Tools | Templates
 * and open the template in the editor.
 */
package Client;

/**
 * @author PlayDK
 */
public enum MapleExpStat {

    // [Int] 活動獎勵經驗值(+%d)
    活動獎勵經驗值(0x1L),
    // [Byte] 怪物額外經驗值(+%d%)
    怪物額外經驗值(0x2L), //每次打3個怪物時給你特別經驗值X%
    // [Byte] 活動組隊經驗值(+%d)
    活動組隊經驗值(0x8L), //活動組隊經驗獎勵倍數(i x 100)最大3倍
    組隊額外經驗值(0x10L),
    結婚紅利經驗值(0x20L), //結婚經驗要在組隊經驗前面
    道具裝備紅利經驗值(0x40L),
    高級服務贈送經驗值(0x80L),
    彩虹週獎勵經驗值(0x100L),
    爆發獎勵經驗值(0x200L),
    秘藥額外經驗值(0x400L),
    // (null)極限屬性經驗值(+%d) - null處客戶端會判斷是否有精靈遊俠的LINK「精靈的祝福」跟神之子角色卡「神使 神之子」
    極限屬性經驗值(0x800L),

    加持獎勵經驗值(0x1000L),
    休息獎勵經驗值(0x2000L),
    道具獎勵經驗值(0x4000L),
    // %s經驗值(+%d)
    道具名經驗值(0x8000L),
    // 依道具%增加經驗值(+%d)
    依道具趴增加經驗值(0x10000L),
    超值包獎勵經驗值(0x20000L),
    // 依道具的組隊任務%增加經驗值(+%d)
    依道具的組隊任務趴增加經驗值(0x40000L),
    累積狩獵數紅利經驗值(0x80000L),
    家族經驗值獎勵(0x100000L),
    冷凍勇士經驗值獎勵(0x200000L),
    // d-[Int]x-[Int] 燃燒場地獎勵經驗 x%(+%d)
    燃燒場地獎勵經驗(0x400000L),
    HP風險經驗值(0x800000L),
    場地紅利經驗(0x1000000L),
    //累積狩獵數紅利經驗值
    累計打獵數量獎勵經驗(0x2000000L),
    活動獎勵經驗值2(0x4000000L),
    網咖摯友獎勵經驗值(0x8000000L),
    場地紅利經驗2(0x10000000L),
    超級小豬幸運_攻擊額外經驗值(0x20000000L),
    伺服器計量條活動獎勵經驗值(0x40000000L),
    未知2(0x80000000L),
    // 公會的訣竅獎勵經驗值(+%d) 和 組隊經驗值增加x%(+%d)
    組隊經驗值增加x趴(0x100000000L),
    蛋糕vs派餅_EXP紅利(0x200000000L),
    Pvp_Bonus_EXP(0x400000000L),
    寵物訓練紅利經驗值(0x800000000L),
    組合道具獎勵經驗值(0x1000000000L),
    組合道具獎勵組隊經驗值(0x2000000000L),
    伺服器加持經驗值(0x4000000000L),
    累積狩獵數紅利經驗值2(0x8000000000L),
    艾爾達斯還原追加經驗值(0x10000000000L),
    ;

    private final long flag;

    MapleExpStat(long flag) {
        this.flag = flag;
    }

    public long getFlag() {
        return flag;
    }
}
