package Config.constants;

public class MapConstants {
    //
    public static boolean isStartingEventMap(final int mapid) {
        switch (mapid) {
            case 109010000: //楓之谷活動 - 尋找寶物
            case 109020001: //楓之谷活動 - OX問答
            case 109030001: //楓之谷活動 - 上樓~上樓~&lt;第1階段>
            case 109030101: //楓之谷活動 - 上樓~上樓~&lt;第1階段>
            case 109030201: //楓之谷活動 - 上樓~上樓~&lt;第1階段>
            case 109030301: //楓之谷活動 - 上樓~上樓~&lt;第1階段>
            case 109030401: //楓之谷活動 - 上樓~上樓~&lt;第1階段>
            case 109040000: //楓之谷活動 - 向高地&lt;待機室>
            case 109060001: //楓之谷活動 - 活動地圖入口
            case 109060002: //隱藏地圖 - 活動地圖入口
            case 109060003: //楓之谷活動 - 活動地圖入口
            case 109060004: //楓之谷活動 - 雪球賽&lt;2階段>
            case 109060005: //楓之谷活動 - 活動地圖入口
            case 109060006: //
            case 109080000: //楓之谷活動 - 椰子比賽
            case 109080001: //楓之谷活動 - 椰子比賽
            case 109080002: //楓之谷活動 - 椰子比賽
            case 109080003: //楓之谷活動 - G★椰子比賽
                return true;
        }
        return false;
    }

    public static boolean isEventMap(final int mapid) {
        return (mapid >= 109010000 && mapid < 109050000) || (mapid > 109050001 && mapid < 109090000) || (mapid >= 809040000 && mapid <= 809040100);
    }

    public static boolean isCoconutMap(final int mapid) {
        return mapid == 109080000 || mapid == 109080001 || mapid == 109080002 || mapid == 109080003 || mapid == 109080010 || mapid == 109080011 || mapid == 109080012 || mapid == 109090300 || mapid == 109090301 || mapid == 109090302 || mapid == 109090303 || mapid == 109090304 || mapid == 910040100;
    }


    public static boolean isBossMap(int mapid) {
        switch (mapid) {
            case 0: //BUG地圖 是個小黑屋
            case 105100400: //巴洛古神殿 - 巴洛古的墓地
            case 105100300: //巴洛古神殿 - 巴洛古的墓地
            case 280030000: //神秘島 - 殘暴炎魔的祭台
            case 280030100: //最後的任務 - 殘暴炎魔的祭台
            case 280030001: //最後的任務 - 進階殘暴炎魔的祭台
            case 240040700: //神木村 - 生命之穴入口
            case 240060200: //生命之穴 - 闇黑龍王洞穴
            case 240060201: //生命之穴 - 進階闇黑龍王洞穴
            case 270050100: //神殿的深處 - 神的黃昏
            case 802000111: //逆奧之城 - 卡姆那 (遠征隊)
            case 802000211: //逆奧之城 - 防禦塔 2100年 (遠征隊)
            case 802000311: //逆奧之城 - 公園 2095年 (遠征隊)
            case 802000411: //逆奧之城 - 高科區域 2102年 (遠征隊)
            case 802000611: //逆奧之城 - 天空大戰艦甲板 2102年 (遠征隊)
            case 802000711: //逆奧之城 - 核心商業區 2102年（遠征隊）
            case 802000801: //逆奧之城 - 商貿中心 2102年(大廳)
            case 802000802: //逆奧之城 - 商貿中心 2102年(升降機井)
            case 802000803: //逆奧之城 - 商貿中心 2102年(入口)
            case 802000821: //逆奧之城 - 商貿中心頂樓 2102年（遠征隊）
            case 802000823: //逆奧之城 - 商貿中心頂樓 2102年（遠征隊）
            case 211070100: //獅子王之城 - 接見室
            case 211070101: //獅子王之城 - 空中監獄
            case 211070110: //獅子王之城 - 復活塔樓
            case 551030200: //馬來西亞 - 陰森世界
            case 271040100: //騎士團要塞 - 西格諾斯的殿堂
            case 271040200: //騎士團要塞 - 西格諾斯的後院
            case 300030310: //艾琳森林 - 女王藏身處
            case 220080001: //玩具城 - 時間塔的本源
                return true;
            default:
                return false;
        }
    }
}
