/*creat  */

var jobList = [
    {
        name: "卡莉",
        id: [15003, 15400, 15410, 15411, 15412],
        tag: ["卡莉", "卡莉（一轉）", "卡莉（二轉）", "卡莉（三轉）", "卡莉（四轉）"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "阿戴爾",
        id: [15002, 15100, 15110, 15111, 15112],
        tag: ["阿戴爾", "阿戴爾（一轉）", "阿戴爾（二轉）", "阿戴爾（三轉）", "阿戴爾（四轉）"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "亞克",
        id: [15001, 15500, 15510, 15511, 15512],
        tag: ["亞克", "亞克（一轉）", "亞克（二轉）", "亞克（三轉）", "亞克（四轉）"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "伊利恩",
        id: [15000, 15200, 15210, 15211, 15212],
        tag: ["伊利恩", "伊利恩（一轉）", "伊利恩（二轉）", "伊利恩（三轉）", "伊利恩（四轉）"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "英雄",
        id: [0, 100, 110, 111, 112],
        tag: ["初心者", "戰士", "劍客", "十字軍", "英雄"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "聖騎士",
        id: [0, 100, 120, 121, 122],
        tag: ["初心者", "戰士", "准騎士", "騎士", "聖騎士"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "黑騎士",
        id: [0, 100, 130, 131, 132],
        tag: ["初心者", "戰士", "槍騎士", "龍騎士", "黑騎士"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "火毒魔導士",
        id: [0, 200, 210, 211, 212],
        tag: ["初心者", "魔法師", "火毒法師", "火毒巫師", "火毒魔導士"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "冰雷魔導士",
        id: [0, 200, 220, 221, 222],
        tag: ["初心者", "魔法師", "冰雷法師", "冰雷巫師", "冰雷魔導士"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "主教",
        id: [0, 200, 230, 231, 232],
        tag: ["初心者", "魔法師", "僧侶", "祭司", "主教"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "神射手",
        id: [0, 300, 310, 311, 312],
        tag: ["初心者", "弓箭手", "獵人", "射手", "神射手"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "箭神",
        id: [0, 300, 320, 321, 322],
        tag: ["初心者", "弓箭手", "弩弓手", "遊俠", "箭神"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "開拓者",
        id: [0, 301, 330, 331, 332],
        tag: ["初心者", "開拓者（一轉）", "開拓者（二轉）", "開拓者（三轉）", "開拓者（四轉）"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: 3,
    },
    {
        name: "夜使者",
        id: [0, 400, 410, 411, 412],
        tag: ["初心者", "盜賊", "刺客", "暗殺者", "夜使者"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "暗影神偷",
        id: [0, 400, 420, 421, 422],
        tag: ["初心者", "盜賊", "俠盜", "神偷", "暗影神偷"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "影武者",
        id: [0, 400, 430, 431, 432, 433, 434],
        tag: ["初心者(影武)", "盜賊(影武)", "下忍", "中忍", "上忍", "隱忍", "影武者"],
        reqLv: [0, 10, 20, 30, 45, 60, 100],
        subJob: 1,
    },
    {
        name: "拳霸",
        id: [0, 500, 510, 511, 512],
        tag: ["初心者", "海盜", "打手", "格鬥家", "拳霸"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "槍神",
        id: [0, 500, 520, 521, 522],
        tag: ["初心者", "海盗", "槍手", "神槍手", "槍神"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "重砲指揮官",
        id: [0, 501, 530, 531, 532],
        tag: ["初心者", "炮手", "重炮兵", "重砲兵隊長", "重砲指揮官"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: 2,
    },
    {
        name: "聖魂騎士",
        id: [1000, 1100, 1110, 1111, 1112],
        tag: ["貴族", "聖魂騎士（一轉）", "聖魂騎士（二轉）", "聖魂騎士（三轉）", "聖魂騎士（四轉）"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "破風使者",
        id: [1000, 1300, 1310, 1311, 1312],
        tag: ["貴族", "破風使者（一轉）", "破風使者（二轉）", "破風使者（三轉）", "破風使者（四轉）"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "暗夜行者",
        id: [1000, 1400, 1410, 1411, 1412],
        tag: ["貴族", "暗夜行者（一轉）", "暗夜行者（二轉）", "暗夜行者（三轉）", "暗夜行者（四轉）"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "閃雷悍將",
        id: [1000, 1500, 1510, 1511, 1512],
        tag: ["貴族", "閃雷悍將（一轉）", "閃雷悍將（二轉）", "閃雷悍將（三轉）", "閃雷悍將（四轉）"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "烈焰巫師",
        id: [1000, 1200, 1210, 1211, 1212],
        tag: ["貴族", "烈焰巫師（一轉）", "烈焰巫師（二轉）", "烈焰巫師（三轉）", "烈焰巫師（四轉）"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "米哈逸",
        id: [5000, 5100, 5110, 5111, 5112],
        tag: ["貴族", "米哈逸（一轉）", "米哈逸（二轉）", "米哈逸（三轉）", "米哈逸（四轉）"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "狂狼勇士",
        id: [2000, 2100, 2110, 2111, 2112],
        tag: ["狂狼勇士", "狂狼勇士（一轉）", "狂狼勇士（二轉）", "狂狼勇士（三轉）", "狂狼勇士（四轉）"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "精靈遊俠",
        id: [2002, 2300, 2310, 2311, 2312],
        tag: ["精靈遊俠", "精靈遊俠（一轉）", "精靈遊俠（二轉）", "精靈遊俠（三轉）", "精靈遊俠（四轉）"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "幻影俠盜",
        id: [2003, 2400, 2410, 2411, 2412],
        tag: ["幻影俠盜", "幻影俠盜（一轉）", "幻影俠盜（二轉）", "幻影俠盜（三轉）", "幻影俠盜（四轉）"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "夜光",
        id: [2004, 2700, 2710, 2711, 2712],
        tag: ["夜光", "夜光（一轉）", "夜光（二轉）", "夜光（三轉）", "夜光（四轉）"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "龍魔導士",
        id: [2001, 2210, 2212, 2216, 2217],
        tag: ["龍魔導士", "龍魔導士（一轉）", "龍魔導士（二轉）", "龍魔導士（三轉）", "龍魔導士（四轉）"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "隱月",
        id: [2005, 2500, 2510, 2511, 2512],
        tag: ["隱月", "隱月（一轉）", "隱月（二轉）", "隱月（三轉）", "隱月（四轉）"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "惡魔殺手",
        id: [3001, 3100, 3110, 3111, 3112],
        tag: ["惡魔殺手", "惡魔殺手（一轉）", "惡魔殺手（二轉）", "惡魔殺手（三轉）", "惡魔殺手（四轉）"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "惡魔復仇者",
        id: [3001, 3101, 3120, 3121, 3122],
        tag: ["惡魔復仇者", "惡魔復仇者（一轉）", "惡魔復仇者（二轉）", "惡魔復仇者（三轉）", "惡魔復仇者（四轉）"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "狂豹獵人",
        id: [3000, 3300, 3310, 3311, 3312],
        tag: ["狂豹獵人", "狂豹獵人（一轉）", "狂豹獵人（二轉）", "狂豹獵人（三轉）", "狂豹獵人（四轉）"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "煉獄巫師",
        id: [3000, 3200, 3210, 3211, 3212],
        tag: ["煉獄巫師", "煉獄巫師（一轉）", "煉獄巫師（二轉）", "煉獄巫師（三轉）", "煉獄巫師（四轉）"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "機甲戰神",
        id: [3000, 3500, 3510, 3511, 3512],
        tag: ["機甲戰神", "機甲戰神（一轉）", "機甲戰神（二轉）", "機甲戰神（三轉）", "機甲戰神（四轉）"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "爆拳槍神",
        id: [3000, 3700, 3710, 3711, 3712],
        tag: ["爆拳槍神", "爆拳槍神（一轉）", "爆拳槍神（二轉）", "爆拳槍神（三轉）", "爆拳槍神（四轉）"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "傑諾",
        id: [3002, 3600, 3610, 3611, 3612],
        tag: ["傑諾", "傑諾（一轉）", "傑諾（二轉）", "傑諾（三轉）", "傑諾（四轉）"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "卡蒂娜",
        id: [6002, 6400, 6410, 6411, 6412],
        tag: ["卡蒂娜", "卡蒂娜（一轉）", "卡蒂娜（二轉）", "卡蒂娜（三轉）", "卡蒂娜（四轉）"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },

    {
        name: "凱撒",
        id: [6000, 6100, 6110, 6111, 6112],
        tag: ["凱撒", "凱撒（一轉）", "凱撒（二轉）", "凱撒（三轉）", "凱撒（四轉）"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "天使破壞者",
        id: [6001, 6500, 6510, 6511, 6512],
        tag: ["天使破壞者", "天使破壞者（一轉）", "天使破壞者（二轉）", "天使破壞者（三轉）", "天使破壞者（四轉）"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "凱殷",
        id: [6003, 6300, 6310, 6311, 6312],
        tag: ["凱殷", "凱殷（一轉）", "凱殷（二轉）", "凱殷（三轉）", "凱殷（四轉）"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "虎影",
        id: [16000, 16400, 16410, 16411, 16412],
        tag: ["虎影", "虎影（一轉）", "虎影（二轉）", "虎影（三轉）", "虎影（四轉）"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "菈菈",
        id: [16001, 16200, 16210, 16211, 16212],
        tag: ["菈菈", "菈菈（一轉）", "菈菈（二轉）", "菈菈（三轉）", "菈菈（四轉）"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "凱內西斯",
        id: [14000, 14200, 14210, 14211, 14212],
        tag: ["凱內西斯", "凱內西斯（一轉）", "凱內西斯（二轉）", "凱內西斯（三轉）", "凱內西斯（四轉）"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "墨玄",
        id: [17000, 17500, 17510, 17511, 17512],
        tag: ["墨玄", "墨玄（一轉）", "墨玄（二轉）", "墨玄（三轉）", "墨玄（四轉）"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "劍豪",
        id: [4001, 4100, 4110, 4111, 4112],
        tag: ["劍豪", "劍豪（一轉）", "劍豪（二轉）", "劍豪（三轉）", "劍豪（四轉）"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "陰陽師",
        id: [4002, 4200, 4210, 4211, 4212],
        tag: ["陰陽師", "陰陽師（一轉）", "陰陽師（二轉）", "陰陽師（三轉）", "陰陽師（四轉）"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
    {
        name: "琳恩",
        id: [17001, 17200, 17210, 17211, 17212],
        tag: ["琳恩", "琳恩（一轉）", "琳恩（二轉）", "琳恩（三轉）", "琳恩（四轉）"],
        reqLv: [0, 10, 30, 60, 100],
        subJob: null,
    },
];

let subjob = player.getSubJob();
let level = player.getLevel();
let jobFilter = []
let flag = false;
var job = player.getJob();

for (var item of jobList) {
    if (subjob > 0) {
        if (subjob == item.subJob) {
            var nowJob = item.id.indexOf(job)
            if (nowJob > -1 && !!item.reqLv[nowJob + 1]) {
                if (level >= item.reqLv[nowJob + 1]) {
                    jobFilter.push({
                        id: item.id[nowJob + 1],
                        name: item.tag[nowJob + 1],
                    });
                } else {
                    flag = item.reqLv[nowJob + 1]
                }
            } else {
                flag = true;
            }
        }
    } else {
        if (item.subJob == null) {
            let nowJob = item.id.indexOf(job);
            if (nowJob > -1 && !!item.reqLv[nowJob + 1]) {
                if (level >= item.reqLv[nowJob + 1]) {
                    jobFilter.push({
                        id: item.id[nowJob + 1],
                        name: item.tag[nowJob + 1],
                    });
                } else {
                    flag = item.reqLv[nowJob + 1];
                }
            } else {
                flag = true;
            }
        }
    }
}


var data = []
var text = "請選擇您要轉職的職業：\r\n#r";
if (jobFilter.length > 0) {
    // 相同的職業去重
    var maper = new Map();
    data = jobFilter.filter((a) => !maper.has(a.id) && maper.set(a.id, 1));
    for (var i in data) {
        text += "#L" + i + "#" + data[i].name + "\r\n";
    }
    var selectJob = npc.askMenu(text);
    var ret = npc.askYesNo("您是否要轉職為：#k#e" + data[selectJob].name + "#n。");
    if (ret == 1) {
        player.setJob(data[selectJob].id);
        player.maxSkills();
        player.gainItem(2431305, 1);
        npc.say("成功轉職為 #k#e" + data[selectJob].name + "#n。");
    }
} else {
    if (flag === false) {
        npc.say("轉職失敗請聯係管理員。")
    } else {
        if (player.getLevel() >= 200 && !player.isQuestCompleted(1465)) {
            player.completeQuest(1465, 0);
            npc.say("#d恭喜你突破了自己的極限！\r\n現在#r我已讓你完成第五次轉職,加油吧，修煉者！", 3003307);
        } else if (player.getLevel() >= 260 && !player.isQuestCompleted(1488)) {
            player.completeQuest(1488, 0);
            player.startQuest(1489, 0);
            player.completeQuest(38601, 0);
            player.completeQuest(38602, 0);
            player.completeQuest(38603, 0);
            player.completeQuest(38604, 0);
            player.completeQuest(38605, 0);
            player.completeQuest(38606, 0);
            player.completeQuest(38607, 0);
            player.completeQuest(38608, 0);
            player.completeQuest(38609, 0);
            player.completeQuest(38612, 0);
            player.completeQuest(38618, 0);
            player.completeQuest(38619, 0);
            player.completeQuest(38620, 0);
            player.completeQuest(38621, 0);
            player.completeQuest(38622, 0);
            player.completeQuest(38623, 0);
            player.completeQuest(1488, 0);
            player.addEdraCount(20999);
            player.gainItem(4009547, 1000)
            player.updateQuestRecordEx(1489, "0exp=0;0=3");
            npc.say("#d恭喜你突破了自己的極限！\r\n現在#r我已讓你完成了第六次轉職，加油吧，修煉者！");
        } else {
            if (flag === true) {
                npc.say("對不起，您現在不能轉職。")
            } else {
                npc.say("對不起，您的等級不足 #r#e" + flag + "#n#k 等，無法進行轉職。")

            }
        }
    }
}
