let Selection = npc.askMenu("#e<小幫手>#n\r\n#L4##b什麼是傷害字型儲存系統?#k#l\r\n#L0##b傷害字型儲存#k#l\r\n#L1##b傷害字型套用#k#l\r\n#L2##b傷害字型刪除#k#l\r\n#L3##b傷害字型儲存欄位擴增#k#l\r\n\r\n#L10#結束對話#l");
switch (Selection) {
    case 4:
        npc.say("可儲存多個傷害字型的系統。#b和道具[傷害字型儲存卷軸]#k額外進行儲存。");
        break;
    case 0:
        npc.say("點選傷害字型欄位視窗的[傷害字型儲存]按鍵可以儲存。但所有欄位額滿時無法儲存。\r\n\r\n#b◎只能儲存目前套用中的傷害字型。\r\n◎部份傷害字型無法儲存。\r\n(豪華網咖傷害字型等)#k");
        break;
    case 1:
        npc.say("點擊2下傷害字型欄位視窗的字型後，就可變更為儲存的傷害字型。\r\n\r\n#b◎請一定鑰確認目前使用中的傷害字型是否有被儲存。\r\n(未被儲存的傷害字型的資訊會被刪除。)\r\n◎套用中的豪華網咖傷害字型被解除。");
        break;
    case 2:
        npc.say("將想要刪除的傷害字型欄位符號拖曳放開後，即可刪除。\r\n\r\n#b◎刪除掉的傷害字型，到再次獲得以前，無法再還原。");
        break;
    case 3:
        npc.say("傷害字型儲存欄位不夠時，使用額外的擴充券可以增加欄位個數。\r\n\r\n#b◎傷害字型儲存欄位最多可擴充96欄。");
        break;
    case 10:
        break;
}
