import { pic } from "scripts/expands/pic.js";
import func from 'scripts/expands/func.js';

const 商店提示 = {
	Npc開場: "你想要購買或兌換甚麼樣的道具呢？",
	Npc商店內容開場: "",
	交易成功提示: "兌換完成。",
};

const 商店內容 = [
	{
		商店名稱: pic.楷體+" 累積推文 兌換 極品裝備",
		是否開放: true,
		商品清單: [
			{顯示:"#fs14# #r #i2635676# x10 (推文10天)", 獲得道具:1182136, 獲得數量:1, 花費道具陣列:[[2635676,10]],素質:{全屬:45,物攻:45,魔攻:45,王傷:5,無視:5,總傷:2}},
			{顯示:"#fs14# #r #i2635676# x10 (推文10天)", 獲得道具:1122296, 獲得數量:1, 花費道具陣列:[[2635676,10]],素質:{全屬:45,物攻:45,魔攻:45,王傷:5,無視:5,總傷:2}}
		],
	},
	{
		商店名稱: pic.楷體+" 累積推文 兌換 經驗型道具",
		是否開放: true,
		商品清單: [
			{顯示:"#fs14# #r #i2635676# x10 (推文3天)", 獲得道具:1122334, 獲得數量:1, 花費道具陣列:[[2635676,3]],素質:{全屬:20,物攻:20,魔攻:20}}
		],
	},
];

// 開啟商店 NPC
func.startShopNpc(商店提示, 商店內容);
