package SwordieX.enums;

import java.util.Arrays;

public enum WeaponType {
    // WT_ Enum, but renamed some to make more sense
    沒有武器(0),
    閃亮克魯(21),// 21(夜光)
    靈魂射手(22),// 22(天使破壞者)
    魔劍(23),// 23(惡魔復仇者)
    能量劍(24),// 24(傑諾)
    記憶長杖(25),// 25(琳恩)
    ESP限製器(26),// 26(凱內西斯)
    鎖鍊(27),// 27(卡蒂娜)
    魔法護腕(28),// 28(伊利恩)
    仙扇(29),// 29(虎影)
    單手劍(30),// 30(英雄、米哈逸、聖騎士)
    單手斧(31),// 31(惡魔殺手)
    單手棍(32),
    短劍(33),// 33(影武者、暗影神偷)
    雙刀(34),// 34(影武者)
    Secondary(35),// 35(所有副手武器的職業，例如幻影俠盜的卡牌)
    手杖(36),// 36(幻影俠盜)
    短杖(37),// 37(冰雷大魔導士、火毒大魔導士、主教、龍魔導士、烈焰巫師、菈菈)
    長杖(38),// 38(煉獄巫師)
    空手(39),
    雙手劍(40),// 40(聖魂劍士、凱撒)
    雙手斧(41),
    雙手棍(42),
    槍(43),// 43(黑騎士)
    矛(44),// 44(狂狼)
    弓(45),// 45(箭神、破風使者)
    弩(46),// 46(狙擊手、狂豹獵人)
    拳套(47),// 47(夜使者、暗夜行者)
    指虎(48),// 48(隱月、閃雷悍將、亞克、拳霸)
    火槍(49),// 49(槍神、機甲戰神)
    雙弩槍(52),// 52(精靈遊俠)
    加農砲(53),// 53(重砲指揮官)
    太刀(54),// 54(劍豪)
    扇子(55),// 55(陰陽師)
    琉(56),// 56(神之子)
    璃(57),// 57(神之子)
    重拳槍(58),// 58(爆拳槍神)
    古代之弓(59),// 59(開拓者)
    調節器(213),// 213(阿戴爾)
    龍息射手(214),// 214(凱殷)
    武拳(403),// 403(墨玄)
    環刃(404),// 404(卡莉)
    ;

    private final int val;

    WeaponType(int val) {
        this.val = val;
    }

    public int getVal() {
        return val;
    }

    public static WeaponType getByVal(int val) {
        return Arrays.stream(values()).filter(wt -> wt.getVal() == val).findAny().orElse(null);
    }
}

